In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({'Corporation_Name':['CVX','EXXON', 'CVX','EXXON', 'GE','GE'],'Sales_Person':['Adam','Alex','Bruce','Jessica', 'Natalie','Rachel'],'Sales_Amount':[2000,5000,10000,45000,60000, 20000]})
df

  Corporation_Name Sales_Person  Sales_Amount
0              CVX         Adam          2000
1            EXXON         Alex          5000
2              CVX        Bruce         10000
3            EXXON      Jessica         45000
4               GE      Natalie         60000
5               GE       Rachel         20000

In [4]:
df_group_by=df.groupby('Corporation_Name')
df_group_by.mean()

                  Sales_Amount
Corporation_Name
CVX                     6000.0
EXXON                  25000.0
GE                     40000.0

In [5]:
df_group_by=df.groupby('Corporation_Name')
df_group_by.median()

                  Sales_Amount
Corporation_Name
CVX                     6000.0
EXXON                  25000.0
GE                     40000.0

In [6]:
df_group_by=df.groupby('Corporation_Name')
df_group_by.std()

                  Sales_Amount
Corporation_Name
CVX                5656.854249
EXXON             28284.271247
GE                28284.271247

In [7]:
df.groupby('Corporation_Name').describe().transpose()

Corporation_Name             CVX         EXXON            GE
Sales_Amount count      2.000000      2.000000      2.000000
             mean    6000.000000  25000.000000  40000.000000
             std     5656.854249  28284.271247  28284.271247
             min     2000.000000   5000.000000  20000.000000
             25%     4000.000000  15000.000000  30000.000000
             50%     6000.000000  25000.000000  40000.000000
             75%     8000.000000  35000.000000  50000.000000
             max    10000.000000  45000.000000  60000.000000

In [11]:
test1=pd.DataFrame({'A':['X1','X2','X3','X4'],'B':['Y1','Y2','Y3','Y4'], 'unique_ID':['Z1','Z2','Z3','Z5'],})
test1

    A   B unique_ID
0  X1  Y1        Z1
1  X2  Y2        Z2
2  X3  Y3        Z3
3  X4  Y4        Z5

In [13]:
test2=pd.DataFrame({'C':['L1','L2','L3','L4'],'D':['M1','M2','M3','M4'], 'unique_ID':['Z1','Z2','Z3','Z6']})
test2

    C   D unique_ID
0  L1  M1        Z1
1  L2  M2        Z2
2  L3  M3        Z3
3  L4  M4        Z6

In [15]:
test5=pd.DataFrame({'A':['X1','X2','X3','X4'],'B':['Y1','Y2','Y3','Y4']}, index=['H1','H2','H3','H4'])
test6=pd.DataFrame({'C':['X1','X2','X3','X4'],'D':['Y1','Y2','Y3','Y4']}, index=['H2','H3','H1','H0'])
test5,test6

(     A   B
 H1  X1  Y1
 H2  X2  Y2
 H3  X3  Y3
 H4  X4  Y4,
      C   D
 H2  X1  Y1
 H3  X2  Y2
 H1  X3  Y3
 H0  X4  Y4)

In [16]:
test5.join(test6, how='inner') ##pd.join() function can be used as follows to merge the two data frames based on thier index

     A   B   C   D
H1  X1  Y1  X3  Y3
H2  X2  Y2  X1  Y1
H3  X3  Y3  X2  Y2

In [17]:
test5.join(test6, how='outer')

      A    B    C    D
H0  NaN  NaN   X4   Y4
H1   X1   Y1   X3   Y3
H2   X2   Y2   X1   Y1
H3   X3   Y3   X2   Y2
H4   X4   Y4  NaN  NaN

### pandas operation

In [18]:
df_ops=pd.DataFrame({'A':[24,21,74,21],'B':[32,31,65,54],'C':['a','b','c','d']})
df_ops

    A   B  C
0  24  32  a
1  21  31  b
2  74  65  c
3  21  54  d

In [19]:
df_ops['A'].unique() # gives the unique number not the repeated ones

array([24, 21, 74], dtype=int64)

In [20]:
df_ops['A'].nunique() # To obtain the number of unique values, ".nunique()" function can be used instead. This will return the number of elements in a data frame that is unique.

3

In [21]:
df_ops.nunique() ## We can also simply obtain the number of unique elements in each column

A    3
B    4
C    4
dtype: int64

In [22]:
df_ops[(df_ops['A']>=20) & (df_ops['B']>=35) & (df_ops['C']== 'c')]

    A   B  C
2  74  65  c

In [27]:
def economics(x): ## here we can write anything instead of m
     return x**2
df_ops['A'].apply(economics)

0     576
1     441
2    5476
3     441
Name: A, dtype: int64

### Pandas lambda expressions
**As discussed, pandas’ lambda expression can be combined with the apply function to perform quick calculations without defining the function first**

In [29]:
df_ops['B'].apply(lambda x: x*4)
#the values in column B of the df_ops data frame are desired to be multiplied by 4, the following lambda expression can be combined with the"apply" function to perform such calculation

0    128
1    124
2    260
3    216
Name: B, dtype: int64

In [32]:
df_ops['D']=df_ops['A'].apply(lambda x: x**2+1)
df_ops['E']=df_ops['B'].apply(lambda x: x**3+x**2+1)
df_ops['F']=df_ops['A'].apply(lambda x: x**4+x**2+5)
df_ops['G']=df_ops['B'].apply(lambda x: x**2+10)
df_ops['ALL']=df_ops['A'].apply(lambda x: x**2+10)+df_ops['A'].apply(lambda x: x**2+10)
df_ops

    A   B  C     D       E         F     G    ALL
0  24  32  a   577   33793    332357  1034   1172
1  21  31  b   442   30753    194927   971    902
2  74  65  c  5477  278851  29992057  4235  10972
3  21  54  d   442  160381    194927  2926    902

In [33]:
df_ops.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'ALL'], dtype='object')

In [34]:
df_ops.sort_values('ALL', ascending=True)

    A   B  C     D       E         F     G    ALL
1  21  31  b   442   30753    194927   971    902
3  21  54  d   442  160381    194927  2926    902
0  24  32  a   577   33793    332357  1034   1172
2  74  65  c  5477  278851  29992057  4235  10972